
#  DEBUG调试

print("哈哈哈1")
print("哈哈哈2")
print("哈哈哈1")
print("哈哈哈4")
print("哈哈哈5")
print("哈哈哈6")

#  1.代码行点击鼠标左键设置断点
#  2.ctrl+D 换行复制
#  3.控制台——点击F8步过执行当行代码不会跳转函数内部执行
#  4.三条杠——强制运行到光标处：跳过断点执行   运行到光标处：不会跳过断点执行

#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#  注释

#  1.单行注释    建议在注释后面加上空格，确保代码的完整性和规范性
#  2.多行注释（快注释）
"""
快注释
"""
#  3.批量化注释   鼠标左键选中代码CTRL+/

#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#  常见输出函数参数：self  sep  end

#  无sep参数   没有设置sep参数，输出数值默认用"空格"来隔开

print(123)  #  输出一个数据
print(123,345)  #  输出两个数据用空格隔开

#  设置sep参数

print("1","2","3","4",sep="@")
print("1","2","3",sep="111")
print("1","2","3",sep="，")


#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#  无end参数      输出后自动换行

print("hhh")    #  用默认值"\n"结尾       \n：换行

print("输入信息",end="\n")               # 遇见\n就换行

#  设置end参数

print("hhh",end="@")   #  结尾用end参数"###"结尾且后面无换行    end只能在结尾时候起作用
print("www","www","www",sep="@",end="0")