#  算术运算符
#  1. 常用运算符   +  -  *   /      加减乘除

print(1 + 2)   # 加
print(1 - 2)   # 减
print(1 * 2)   # 乘
print(1 / 2)   # 除


#  2.不常用运算符

#  整除    //       先除法得到结果再在数学数轴基础上向左取整数
print(7 // 3)      # 2.xxx在数轴上向左取为2
print(-7 // 3)     # -2.xxx在数轴上向左取为-3


#  取余数/取模    %      两数相处后的余数部分
print(8 % 3)     # 8 / 3 = 2.xxx      8 - 2 * 3 =2
print(-8 % 3)    # -8 / 3 = -2.xxx     -8 - 3 * (-3) = 1


#  指数幂  **

print(2 ** 4)     #  2*2*2*2


# 运算规则
# 1.先乘除后加减
# 2.同级运算符从左往右计算
# 3.可以用（）调整计算优先级
# 运算符优先级顺序   **  大于  *  /  %  //  大于  +  -

#print(10 - 8 / (3 + 1) * 6 // 2 + 15 % 2 ** 3)
#print(10 - 8 / 4 * 6 // 2 + 15 % 2 ** 3)
#print(10 - 8 / 4 * 6 // 2 + 15 % 8)
#print(10 - 2.0 * 6 // 2 + 15 % 8)
#print(10 - 12.0 // 2 + 15 % 8)
#print(10 - 6.0 + 15 % 8)
#print(10 - 6.0 + 7)
#print(11.0)

#——————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#  赋值运算符

#  1.直接赋值运算符   =

aaa = 10                  #直接赋值给变量
print(aaa)

bbb = aaa                 #将一个变量直接赋值给另一个变量
print(bbb)

result = bbb + aaa        #将运算结果赋值给变量
print(result)

#  2.加法赋值运算符    +=       x + = y 相当于 x + y = x

ccc = 3
ccc += 1
print(ccc)

#  3.减法赋值运算符    -=     同上

ccc = 4
ccc -= 1
print(ccc)

#  4.乘法赋值运算符    *=

ccc = 3
ccc *= 3
print(ccc)

#  5.除法赋值运算符     /=

ccc = 3
ccc /= 3
print(ccc)

#  6.整除赋值运算符    //=

ccc = 7
ccc //= 3
print(ccc)

#  7.取余赋值运算符    %=

ccc = 10
ccc %= 3
print(ccc)

#  8.指数赋值运算符   **=

ccc = 3
ccc **= 3
print(ccc)

'复合赋值运算符只能使用已经存在的变量'





