# 编写一个程序，让用户反复输入整数，程序会统计：
# 正数的个数和总和
# 负数的个数和总和
# 零的个数
# 当用户输入 1000 时程序结束，并显示所有统计结果。
# 程序运行示例：
# text
# 数字分类统计器
# 请输入整数（输入1000结束）: 5
# 正数: 个数=1, 总和=5
# 请输入整数（输入1000结束）: -3
# 负数: 个数=1, 总和=-3
# 请输入整数（输入1000结束）: 0
# 零的个数: 1
# 请输入整数（输入1000结束）: 8
# 正数: 个数=2, 总和=13
# 请输入整数（输入1000结束）: -2
# 负数: 个数=2, 总和=-5
# 请输入整数（输入1000结束）: 1000
# === 统计结果 ===
# 正数: 个数=2, 总和=13
# 负数: 个数=2, 总和=-5
# 零: 个数=1
print("数字分类统计器")
num = int(input("请输入整数："))
sum_1 = 0
sum_2 = 0
i_1 = 0
i_2 = 0
i_3 = 0
while num != 1000 :
    if num > 0 :
        i_1 += 1
        sum_1 += num
        print(f"正数：个数=：{i_1}，总和={sum_1}")
        num = int(input("请输入整数："))
    elif num < 0 :
        i_2 += 1
        sum_2 += num
        print(f"负数：个数=：{i_2}，总和：{sum_2}")
        num = int(input("请输入整数："))
    else:
        i_3 += 1
        print(f"零的个数:{i_3}")
        num = int(input("请输入整数："))
print("\t统计结果\t")
print(f"正数：个数=：{i_1}，总和={sum_1}\n负数：个数=：{i_2}，总和：{sum_2}\n零：个数={i_3}")





